app/views/posts/index.html.erb

      <div class="post">
        <h2><%= post.user.first_name %> <%= post.user.last_name %></p>
---
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."post_id" = $1  [["post_id", 19]]

          <p><%= post.caption %></p>
          <%= link_to "Like (#{post.users_liked.length})", like_path(post), method: :patch %>
---
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."post_id" = $1  [["post_id", 1]]