app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <strong>User:</strong>
  <%= @post.user.first_name %> <%= @post.user.last_name %>