app/controllers/comments_controller.rb

  def create
    @comment = Comment.new
    @comment.content = params[:comment][:content]
    @comment.user_id = current_user.id
    @comment.post_id = @@temp

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hi"], ["user_id", 2], ["post_id", 48], ["created_at", "2018-11-27 07:45:16.965732"], ["updated_at", "2018-11-27 07:45:16.965732"]]