app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "comments".* FROM "comments"
SELECT "users".* FROM "users"
---
  def index
    @posts = Post.all
    @comments = Comment.all
    @users = User.all

INSERT INTO "posts" ("user_id", "caption", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["caption", "fijwfoinf"], ["created_at", "2018-11-25 01:03:28.276244"], ["updated_at", "2018-11-25 01:03:28.276244"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.caption = params[:post][:caption]
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "caption" = $1, "created_at" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["caption", "what the changed"], ["created_at", "2018-11-26 00:02:45.235604"], ["updated_at", "2018-11-26 00:02:45.242123"], ["id", 42]]
---
  def update
    @post.caption = params[:post][:caption]
    @post.created_at = DateTime.now.in_time_zone("Pacific Time (US & Canada)")
    respond_to do |format|
      if @post.save

SELECT "likes".* FROM "likes"
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 17]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 49]]
SELECT "comments".* FROM "comments"
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 51]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def destroy
    Like.all.each do |like|
      if like.post == @post
        like.destroy
      end
    end
    Comment.all.each do |comment|
      if comment.post == @post
        comment.destroy
      end
    end
    @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 2], ["post_id", 50], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["post_id", 50], ["created_at", "2018-11-27 07:46:21.192645"], ["updated_at", "2018-11-27 07:46:21.192645"]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 13]]
---
  def like
    @post = Post.find(params[:id]) # or, @post = Post.find_by(id: params[:id])
    @like = Like.find_by(user: current_user, post: @post)
    if @like.nil?
      @like = Like.create(user: current_user, post: @post)
    else
      @like.destroy