app/controllers/posts_controller.rb

  def like
    @post = Post.find(params[:id]) # or, @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]